cask_args appdir: '/Applications'

tap 'caskroom/cask'

#brew 'apple-gcc42
brew 'bash'
brew 'cmake'
brew 'wget'
brew 'curl'
brew 'httpie'
brew 'mackup'
brew 's3cmd'
brew 'git'
brew 'vim', args: ['--override-system-vi']
brew 'ack'
brew 'the_silver_searcher'
#brew 'pt'
brew 'tmux'
#brew 'reattach-to-user-namespace'
brew 'p7zip'
brew 'ctags'
brew 'wrk'
brew 'sshuttle'
brew 'mitmproxy'
brew 'ffmpeg'

brew 'go'

brew 'direnv'
brew 'chruby'
brew 'ruby-install'
#brew 'heroku-toolbelt'
brew 'carthage'

#cask 'xquartz'

cask 'appcleaner'
cask 'the-unarchiver'
#cask 'cakebrew'

#cask 'boot2docker'
#cask 'vagrant'

cask 'spectacle'
#cask 'shiftit'
#cask 'slate'

#cask 'osxfuse'
#cask 'sshfs'

#cask 'gitx-rowanj'
#cask 'hipchat'
cask 'karabiner'
cask 'vlc'
#cask 'spotify'
#cask 'cocoarestclient'
cask 'easysimbl'
#cask 'flux'
cask 'firefox'
cask 'google-chrome'
#cask 'node-webkit'
#cask 'multibit'
#cask 'bittorrent-sync'
cask 'imageoptim'
#cask 'lightpaper'
#cask 'inboaard'
#cask 'nitrous-desktop'
#cask 'ibettercharge'
#cask 'hype'
cask 'skype'
#cask 'postgres'
cask 'sequel-pro'
#cask 'intalll psequel'
#cask 'robomongo'
#cask 'rdm'
#cask 'selfcontrol'
#cask 'rescuetime'
cask 'colorpicker-skalacolor'
cask 'colorpicker-developer'
#cask 'simpholders'
#cask 'sketch-toolbox'
cask 'flowdock'
cask 'recordit'
#cask 'licecap'

cask 'deploymate'
cask 'spark-inspector'
#cask 'taskmate'

brew 'node'
brew 'redis'
brew 'mysql'
brew 'memcached'
brew 'mongodb'
brew 'postgresql'

brew 'phantomjs'

#brew 'logstalgia'
#brew 'pkgconfig'
brew 'imagemagick'

#brew 'dnsmasq'
#brew 'rinetd'
#brew 'ec2-ami-tools'
#brew 'ec2-api-tools'
#brew 'elb-tools'

