cask_args appdir: '/Applications'

tap 'caskroom/cask'

#brew 'apple-gcc42
brew 'bash'
brew 'cmake'
brew 'wget'
brew 'curl'
brew 'httpie'
brew 'mackup'
brew 's3cmd'
brew 'git'
brew 'vim'
brew 'ack'
brew 'ripgrep'
brew 'the_silver_searcher'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'ctags'
brew 'wrk'
brew 'sshuttle'
brew 'mitmproxy'
brew 'ffmpeg'

brew 'go'

brew 'direnv'
brew 'chruby'
brew 'ruby-install'
brew 'carthage'

brew 'swiftlint'

cask 'gpg-suite'
cask 'appcleaner'
cask 'the-unarchiver'

cask 'spectacle'

cask 'vlc'
cask 'firefox'
cask 'google-chrome'
cask 'imageoptim'
#cask 'ibettercharge'
#cask 'hype'
#cask 'postgres'
cask 'sequel-pro'
#cask 'intalll psequel'
cask 'colorpicker-skalacolor'
cask 'colorpicker-developer'
cask 'licecap'
cask 'simsim'

#brew 'redis'
#brew 'mysql'
#brew 'memcached'
#brew 'mongodb'
#brew 'postgresql'

#brew 'logstalgia'
brew 'pkg-config'
brew 'imagemagick'

#brew 'dnsmasq'
#brew 'rinetd'
#brew 'ec2-ami-tools'
#brew 'ec2-api-tools'
#brew 'elb-tools'

